{
  "header": {
    "name": "Lee Sihyeong",
    "intro": "Frontend & Backend Developer"
  },
  "navbar": {
    "aboutMe": "About Me",
    "resume": "Resume",
    "articles": "Projects"
  },
  "aboutMe": {
    "title": "Hello!",
    "title-content": "I want to design user experiences and create a better society through technology.",
    "title-content-2": "Based on human-centered HCI and UX, I aim to build solid skills from front-end to back-end in order to develop web services that solve problems and create value.",
    "my-story-title": "My Story",
    "my-story-content": "I developed a strong interest in the impact of digital media—especially social media—on our world while studying media in college. This interest naturally led me to explore IT service planning and development, and eventually inspired me to pursue a career as a developer.My goal is to enhance user experience from a truly user-centric perspective, focusing on user-friendly web development. I aim to solve user problems and ultimately drive positive social change through the services I build. Beyond acquiring technical knowledge as a developer, I also enjoy thinking about the philosophy of technology and how it shapes our society. If any of this resonates with you, I’d love to discuss it further together!",
    "mission-title": "My Mission",
    "mission-content": "As a passionate web developer, my mission is to create innovative and user-centric websites that enhance digital experiences. I strive to blend cutting-edge technologies with creative design to deliver solutions that not only meet but exceed client expectations. Committed to continuous learning and excellence, I aim to contribute meaningfully to every project I undertake.",
    "skills-title": "My Vision",
    "skills-content": "My vision is to become a leading web developer recognized for transforming ideas into seamless and impactful digital solutions. I aspire to drive the evolution of web technologies, fostering a more connected and accessible online world. By prioritizing quality, collaboration, and sustainability, I seek to inspire and empower businesses and individuals through exceptional web development.",
    "more-about-me-btn": "Want to know more about me?"
  },
  "resume": {
    "time-line-content-university": "Chung-Ang University (Seoul, Korea)",
    "time-line-content-university-1": "Social Science",
    "time-line-content-university-2": "Media Communication",
    "time-line-content-military": "Military Service",
    "time-line-content-military-1": "Completed mandatory military duty",
    "time-line-content-military-2": "21st Air Division",
    "time-line-content-bootcamp": "Project Manager Bootcamp",
    "time-line-content-bootcamp-1": "Acquired foundational knowledge in IT service planning, design, and development essential for a project manager",
    "time-line-content-bootcamp-2": "Collaborated with corporate partners on projects, contributing to planning and UX proposals",
    "time-line-content-study": "Nomadcoder React Study",
    "time-line-content-study-1": "Studied React and TypeScript",
    "time-line-content-study-2": "Gained experience through small-scale personal projects",
    "time-line-content-study-3": "Participated in developer community meetups",
    "time-line-content-academy": "SC IT Academy",
    "time-line-content-academy-1": "Learned full-stack web development",
    "time-line-content-academy-2": "Engaged in a team project for web service development",
    "languages-korean": "Korean",
    "languages-english": "English",
    "languages-japanese": "Japanese",
    "projects1-title": "Taiso",
    "projects1-content": "Community web service for cyclists to gather and share routes",
    "projects1-sub-content-1": "- Selected technology stack and designed system architecture (established team development strategy based on GitHub Flow)",
    "projects1-sub-content-2": "- Implemented global authentication state management using Zustand and access control with Private Routes",
    "projects1-sub-content-3": "- Optimized performance and UX by automatically generating route images on the backend upon GPX upload",
    "projects1-sub-content-4": "- Established secure authentication and authorization using Spring Security, JWT, and HTTP-only cookies",
    "projects1-sub-content-5": "- Integrated Strava API and Kakao Map API for visualizing external data",

    "projects2-title": "My.gg",
    "projects2-content": "Web service for searching and analyzing game statistics using Riot Games API",
    "projects2-sub-content-1": "- Solely responsible for frontend development, designed and optimized component architecture and API communication structure",
    "projects2-sub-content-2": "- Developed user search component focused on UX, optimizing search performance with a custom debounce hook",
    "projects2-sub-content-3": "- Implemented responsive tooltip components for game items, providing contextual information based on image position",
    "projects2-sub-content-4": "- Proposed and led the adoption of NoSQL (MongoDB)",
    "projects2-sub-content-5": "- Improved loading performance by minimizing data payload",

    "projects3-title": "Syhyeong.me",
    "projects3-content": "Personal portfolio website",
    "projects3-sub-content-1": "- Personal portfolio built with Next.js and TypeScript",
    "projects3-sub-content-2": "- Implemented multilingual support, theme switching, and markdown-based content management",
    "projects3-sub-content-3": "- Improved loading efficiency and user experience by properly separating server and client components",
    "projects3-sub-content-4": "",
    "projects3-sub-content-5": "",

    "projects4-title": "Twitter Clone",
    "projects4-content": "Clone website of Twitter",
    "projects4-sub-content-1": "- Developed a Twitter clone web service using Next.js 14 and Server Actions",
    "projects4-sub-content-2": "- Implemented authentication using Prisma, PostgreSQL, iron-session, and bcrypt",
    "projects4-sub-content-3": "- Experienced full-stack development cycle, gaining skills in SSR/CSR, type safety, and responsive UI",
    "projects4-sub-content-4": "",
    "projects4-sub-content-5": "",

    "projects5-title": "Movie Rank App",
    "projects5-content": "Movie ranking application",
    "projects5-sub-content-1": "- Built UI with React and TypeScript, including animations and modal-based detail views",
    "projects5-sub-content-2": "- Efficiently handled data fetching and state management using React Query",
    "projects5-sub-content-3": "- Integrated smooth animation effects using Framer Motion",
    "projects5-sub-content-4": "",
    "projects5-sub-content-5": "",

    "projects6-title": "Crypto Tracker",
    "projects6-content": "Web service for tracking cryptocurrency prices",
    "projects6-sub-content-1": "- Developed a tracker-style web service displaying real-time cryptocurrency information",
    "projects6-sub-content-2": "- Managed state and visualized data using React, TypeScript, React Query, and Recoil",
    "projects6-sub-content-3": "- Implemented various user-friendly features including dark mode, responsive UI, and chart functionalities",
    "projects6-sub-content-4": "",
    "projects6-sub-content-5": ""
  }
}
