{
  "header": {
    "name": "Lee Sihyeong",
    "intro": "Frontend & Backend Developer"
  },
  "navbar": {
    "aboutMe": "About Me",
    "resume": "Resume",
    "articles": "Articles"
  },
  "aboutMe": {
    "title": "Hello!",
    "title-content": "I want to design user experiences and create a better society through technology.",
    "title-content-2": "Based on human-centered HCI and UX, I aim to build solid skills from front-end to back-end in order to develop web services that solve problems and create value.",
    "my-story-title": "My Story",
    "my-story-content": "I developed a strong interest in the impact of digital media—especially social media—on our world while studying media in college. This interest naturally led me to explore IT service planning and development, and eventually inspired me to pursue a career as a developer.My goal is to enhance user experience from a truly user-centric perspective, focusing on user-friendly web development. I aim to solve user problems and ultimately drive positive social change through the services I build. Beyond acquiring technical knowledge as a developer, I also enjoy thinking about the philosophy of technology and how it shapes our society. If any of this resonates with you, I’d love to discuss it further together!",
    "mission-title": "My Mission",
    "mission-content": "As a passionate web developer, my mission is to create innovative and user-centric websites that enhance digital experiences. I strive to blend cutting-edge technologies with creative design to deliver solutions that not only meet but exceed client expectations. Committed to continuous learning and excellence, I aim to contribute meaningfully to every project I undertake.",
    "skills-title": "My Vision",
    "skills-content": "My vision is to become a leading web developer recognized for transforming ideas into seamless and impactful digital solutions. I aspire to drive the evolution of web technologies, fostering a more connected and accessible online world. By prioritizing quality, collaboration, and sustainability, I seek to inspire and empower businesses and individuals through exceptional web development.",
    "more-about-me-btn": "Want to know more about me?"
  },
  "resume": {
    "time-line-content-university": "Chung-Ang University (Seoul, Korea)",
    "time-line-content-university-1": "Social Science",
    "time-line-content-university-2": "Media Communication",
    "time-line-content-military": "Military Service",
    "time-line-content-military-1": "Completed mandatory military duty",
    "time-line-content-military-2": "21st Air Division",
    "time-line-content-bootcamp": "Project Manager Bootcamp",
    "time-line-content-bootcamp-1": "Acquired foundational knowledge in IT service planning, design, and development essential for a project manager",
    "time-line-content-bootcamp-2": "Collaborated with corporate partners on projects, contributing to planning and UX proposals",
    "time-line-content-study": "Nomadcoder React Study",
    "time-line-content-study-1": "Studied React and TypeScript",
    "time-line-content-study-2": "Gained experience through small-scale personal projects",
    "time-line-content-study-3": "Participated in developer community meetups",
    "time-line-content-academy": "SC IT Academy",
    "time-line-content-academy-1": "Learned full-stack web development",
    "time-line-content-academy-2": "Engaged in a team project for web service development",
    "projects1-title": "My.gg",
    "projects1-content": "Online Game Score Search Service",
    "projects2-title": "Taiso",
    "projects2-content": "Bike Gathering Platform",
    "projects3-title": "syhyeong.me",
    "projects3-content": "Portfolio Website"
  }
}
